Revit 2025 API
ChangePriority Enumeration
 Enum used to specify the priority of an Updater during execution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ChangePriority
Public Enumeration ChangePriority
public enum class ChangePriority
type ChangePriority
Members
Member name | Value | Description
GridsLevelsReferencePlanes | 0 |  Updater will modify core datums and major reference planes
Masses | 1 |  Updater will modify masses
FloorsRoofsStructuralWalls | 2 |  Updater will modify exterior shell of the building or floor slabs
Structure | 3 |  Updater will modify structural elements like beams, braces, columns and trusses
InteriorWalls | 4 |  Updater will modify interior/partition walls
DoorsOpeningsWindows | 5 |  Updater will modify family instances that cut their hosts like doors and windows
MEPFixtures | 6 |  Updater will modify MEP fixtures such as lights, sinks, equipment, etc.
RoomsSpacesZones | 7 |  Updater will modify Rooms, MEP spaces or zones
MEPCalculations | 8 |  Updater will update MEP calculated values
FreeStandingComponents | 9 |  Updater will modify standalone components
Connections | 10 |  Updater will modify connections
Rebar | 11 |  Updater will modify rebar
MEPAccessoriesFittingsSegmentsWires | 12 |  Updater will modify MEP elements such as segments, fittings and wires
MEPSystems | 13 |  Updater will modify MEP systems or circuits
Views | 14 |  Updater will modify views
DetailComponents | 15 |  Updater will modify detail components and symbolic lines
Annotations | 16 |  Updater will modify annotations
Remarks
 The enumeration values are ordered in the order in which updaters associated to each priority will be run. For example, updaters associated to priority GridsLevelsReferencePlanes will run first, while updaters associated to priority Annotations will run last.
See Also
Reference
Autodesk.Revit.DB Namespace